#  Шаховий кінь ходить буквою "Г" - на дві клітини по вертикалі в будь-якому напрямку і на одну
# клітку по горизонталі, або навпаки. Дано дві різні клітини шахової дошки, визначте, чи може кінь
# потрапити з першої клітини на другу одним ходом.
a1 = int(input("Ввести число = "))
b1 = int(input("Ввести число = "))
a2 = int(input("Ввести число = "))
b2 = int(input("Ввести число = "))
da = abs(a1 - a2)
db = abs(b1 - b2)
if da == 1 and db == 2 or da == 2 and db == 1:
    print("Так")
else:
    print("Ні")