# За довжинами трьох відрізків, введених користувачем, визначити можливість існування
трикутника, складеного з цих відрізків. Якщо такий трикутник існує, то визначити, чи є він
різнобічним, рівнобедреним або рівностороннім
a = int(input("Сторона a = "))
b = int(input("Сторона b = "))
c = int(input("Сторона c = "))
if a < b < c or b < a < c or c < b < a:
    print("Трикутник є різностороннім!")
else:
    print("Трикутник не є різностороннім!")
if a == b == c :
    print("Трикутник є рівностороннім!")
else:
    print("Трикутник не є рівностороннім!")
if a == b < c or c == a < b or b == c < a:
    print("Трикутник є рівнобедреним!")
else:
    print("Трикутник не є рівнобедреним!")